{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "th": 99,
      "ma": 100,
      "in": 101,
      "al": 102,
      "en": 103,
      "is": 104,
      "on": 105,
      "re": 106,
      "ti": 107,
      "le": 108,
      "er": 109,
      "math": 110,
      "cal": 111,
      "te": 112,
      "an": 113,
      "of": 114,
      "to": 115,
      "the": 116,
      "se": 117,
      "mathcal": 118,
      "mma": 119,
      "or": 120,
      "es": 121,
      "be": 122,
      "$\\": 123,
      "tion": 124,
      "ro": 125,
      "ar": 126,
      "lemma": 127,
      "om": 128,
      "at": 129,
      "Le": 130,
      "$.": 131,
      "and": 132,
      "su": 133,
      "si": 134,
      "ch": 135,
      "ph": 136,
      "fin": 137,
      "pro": 138,
      "ra": 139,
      "lo": 140,
      "ref": 141,
      "ent": 142,
      "ing": 143,
      "ec": 144,
      "ac": 145,
      "ge": 146,
      "ver": 147,
      "ite": 148,
      "we": 149,
      "that": 150,
      "ve": 151,
      "de": 152,
      "}$": 153,
      "me": 154,
      "ly": 155,
      "Th": 156,
      "qu": 157,
      "orph": 158,
      "$$": 159,
      "mes": 160,
      "end": 161,
      "(\\": 162,
      "ism": 163,
      "orphism": 164,
      ")$": 165,
      "ts": 166,
      "ate": 167,
      "ce": 168,
      "as": 169,
      "du": 170,
      "gin": 171,
      "begin": 172,
      "Lemma": 173,
      "ri": 174,
      "Let": 175,
      "_i": 176,
      "over": 177,
      "po": 178,
      "for": 179,
      "im": 180,
      "times": 181,
      "com": 182,
      "ul": 183,
      "{\\": 184,
      "no": 185,
      "st": 186,
      "la": 187,
      "it": 188,
      "ic": 189,
      "proof": 190,
      "mo": 191,
      "})": 192,
      "un": 193,
      "xt": 194,
      "morphism": 195,
      "ta": 196,
      "finite": 197,
      "sp": 198,
      "ction": 199,
      "co": 200,
      "con": 201,
      "sh": 202,
      "set": 203,
      "by": 204,
      "ld": 205,
      "bra": 206,
      "gebra": 207,
      "sub": 208,
      "_1": 209,
      "times_": 210,
      "ation": 211,
      "jec": 212,
      "^{": 213,
      "}.": 214,
      "wi": 215,
      "bel": 216,
      "map": 217,
      "^\\": 218,
      "comp": 219,
      "us": 220,
      "di": 221,
      "tive": 222,
      "ence": 223,
      "ex": 224,
      "che": 225,
      "fi": 226,
      "fra": 227,
      "text": 228,
      "label": 229,
      "item": 230,
      "af": 231,
      "wh": 232,
      "mathfra": 233,
      "mathfrak": 234,
      "sche": 235,
      "et": 236,
      "algebra": 237,
      "see": 238,
      "local": 239,
      "let": 240,
      "}(": 241,
      "per": 242,
      "qua": 243,
      "$,": 244,
      "dule": 245,
      "with": 246,
      "The": 247,
      "$-": 248,
      "module": 249,
      "subset": 250,
      "ind": 251,
      "act": 252,
      "defin": 253,
      "section": 254,
      "mer": 255,
      "are": 256,
      "gh": 257,
      "op": 258,
      "sion": 259,
      "spac": 260,
      "ap": 261,
      "indent": 262,
      "noindent": 263,
      "pre": 264,
      "log": 265,
      "ition": 266,
      "ots": 267,
      "ring": 268,
      "quasi": 269,
      "ds": 270,
      "bul": 271,
      "bullet": 272,
      "ldots": 273,
      "Sp": 274,
      "if": 275,
      "ale": 276,
      "tor": 277,
      "ble": 278,
      "equ": 279,
      "ty": 280,
      "ci": 281,
      "eri": 282,
      "etale": 283,
      "_n": 284,
      "ed": 285,
      "ol": 286,
      "coh": 287,
      "'$": 288,
      "iv": 289,
      "low": 290,
      "ase": 291,
      "this": 292,
      "mp": 293,
      "_0": 294,
      "_X": 295,
      "jective": 296,
      "lim": 297,
      "she": 298,
      "Then": 299,
      "gor": 300,
      "umer": 301,
      "ategor": 302,
      "scheme": 303,
      "mal": 304,
      "enumer": 305,
      "enumerate": 306,
      "We": 307,
      "lat": 308,
      "definition": 309,
      "up": 310,
      "bf": 311,
      "otimes_": 312,
      "logy": 313,
      "ght": 314,
      "ob": 315,
      "comple": 316,
      "par": 317,
      "ine": 318,
      "pres": 319,
      "mathbf": 320,
      "ha": 321,
      "such": 322,
      "proper": 323,
      "flat": 324,
      "int": 325,
      "line": 326,
      "^{-": 327,
      "fun": 328,
      "ollow": 329,
      "then": 330,
      "},": 331,
      "ki": 332,
      "row": 333,
      "bo": 334,
      "follow": 335,
      "omo": 336,
      "have": 337,
      ")$.": 338,
      "$(": 339,
      "tri": 340,
      "}$.": 341,
      "ct": 342,
      "Spec": 343,
      "sed": 344,
      "var": 345,
      "clo": 346,
      "arrow": 347,
      "ru": 348,
      "open": 349,
      "f_": 350,
      "ated": 351,
      "morphisms": 352,
      "categor": 353,
      "omorphism": 354,
      "^*": 355,
      "can": 356,
      "right": 357,
      "ies": 358,
      "spaces": 359,
      "locally": 360,
      "func": 361,
      "fine": 362,
      "kip": 363,
      "ur": 364,
      "ore": 365,
      "_2": 366,
      "meds": 367,
      "medskip": 368,
      "algebraic": 369,
      "pha": 370,
      "alpha": 371,
      "affine": 372,
      "ga": 373,
      "ment": 374,
      "By": 375,
      "In": 376,
      "closed": 377,
      "ack": 378,
      "ho": 379,
      "der": 380,
      "iz": 381,
      "dim": 382,
      "oth": 383,
      "present": 384,
      "there": 385,
      "app": 386,
      "phi": 387,
      "rom": 388,
      "gen": 389,
      "gra": 390,
      "omology": 391,
      "No": 392,
      "ension": 393,
      "erent": 394,
      "from": 395,
      "}(\\": 396,
      "sume": 397,
      "ted": 398,
      "ves": 399,
      "lon": 400,
      "ere": 401,
      "ich": 402,
      "X_": 403,
      "exis": 404,
      "sition": 405,
      "rc": 406,
      "maps": 407,
      "circ": 408,
      "mb": 409,
      "functor": 410,
      "which": 411,
      "ince": 412,
      ").": 413,
      "ff": 414,
      "This": 415,
      "coherent": 416,
      "varphi": 417,
      "modules": 418,
      "position": 419,
      "})$": 420,
      "\\\\": 421,
      "Hence": 422,
      "so": 423,
      "overline": 424,
      "_j": 425,
      "ome": 426,
      "do": 427,
      "gener": 428,
      "bi": 429,
      "ll": 430,
      "If": 431,
      "isomorphism": 432,
      "}\\": 433,
      "')": 434,
      "sheaf": 435,
      "\\'": 436,
      "complex": 437,
      "category": 438,
      "cl": 439,
      "sur": 440,
      "}^": 441,
      "mar": 442,
      "da": 443,
      "mark": 444,
      "objec": 445,
      "use": 446,
      "schemes": 447,
      "its": 448,
      "base": 449,
      "pl": 450,
      "stru": 451,
      "xi": 452,
      "}^\\": 453,
      "not": 454,
      "ose": 455,
      "As": 456,
      "mbda": 457,
      "Co": 458,
      "ide": 459,
      "chan": 460,
      "uni": 461,
      "des": 462,
      "long": 463,
      "eth": 464,
      "De": 465,
      "pe": 466,
      "rightarrow": 467,
      "mple": 468,
      "Thus": 469,
      "sho": 470,
      "change": 471,
      "topo": 472,
      "where": 473,
      "has": 474,
      "ties": 475,
      "exact": 476,
      "exists": 477,
      "Since": 478,
      "type": 479,
      "space": 480,
      "follows": 481,
      "eld": 482,
      "all": 483,
      "dia": 484,
      "mu": 485,
      "ial": 486,
      "case": 487,
      "bre": 488,
      "cover": 489,
      "matri": 490,
      "ree": 491,
      "erian": 492,
      "etherian": 493,
      "matrix": 494,
      "ample": 495,
      "field": 496,
      "redu": 497,
      "ad": 498,
      "separ": 499,
      "Al": 500,
      "kapp": 501,
      "kappa": 502,
      "pp": 503,
      "Coh": 504,
      "fibre": 505,
      "surjective": 506,
      "ical": 507,
      "ular": 508,
      "giv": 509,
      "ter": 510,
      "ext": 511,
      "mooth": 512,
      "equiv": 513,
      "}}": 514,
      "id": 515,
      "sa": 516,
      "point": 517,
      "show": 518,
      "smooth": 519,
      "ect": 520,
      "Noetherian": 521,
      "cap": 522,
      "ima": 523,
      "equival": 524,
      "may": 525,
      "tit": 526,
      "geq": 527,
      "ideal": 528,
      "gro": 529,
      "zer": 530,
      "shea": 531,
      "zero": 532,
      "any": 533,
      "Algebra": 534,
      "compact": 535,
      "sequ": 536,
      "ir": 537,
      "covering": 538,
      "resp": 539,
      "lus": 540,
      "oplus": 541,
      "'}": 542,
      "remark": 543,
      "tain": 544,
      "/\\": 545,
      "tex": 546,
      "site": 547,
      "big": 548,
      "ally": 549,
      "Hom": 550,
      "ne": 551,
      "textit": 552,
      "il": 553,
      "ut": 554,
      "longrightarrow": 555,
      "able": 556,
      "wed": 557,
      "dis": 558,
      "ian": 559,
      "abo": 560,
      "dimension": 561,
      "ved": 562,
      "cohomology": 563,
      "lta": 564,
      "presentation": 565,
      "ity": 566,
      "Pro": 567,
      "),": 568,
      "limits": 569,
      "very": 570,
      "gram": 571,
      "otimes": 572,
      "object": 573,
      "diagram": 574,
      "''": 575,
      "}).": 576,
      "sheaves": 577,
      "image": 578,
      "pi": 579,
      "constru": 580,
      "enti": 581,
      "stack": 582,
      "uation": 583,
      "ded": 584,
      "sequence": 585,
      "commu": 586,
      "desc": 587,
      "above": 588,
      "ele": 589,
      "element": 590,
      "clu": 591,
      "_U": 592,
      "Sh": 593,
      "some": 594,
      "xy": 595,
      "produ": 596,
      "given": 597,
      "every": 598,
      "equal": 599,
      "For": 600,
      "wedge": 601,
      "}'": 602,
      "inver": 603,
      "U_i": 604,
      "Assume": 605,
      "od": 606,
      "xymatrix": 607,
      "tible": 608,
      "separated": 609,
      "erived": 610,
      "psi": 611,
      "rela": 612,
      "aces": 613,
      "orphisms": 614,
      "assume": 615,
      "following": 616,
      "^*\\": 617,
      "sum": 618,
      "injective": 619,
      "More": 620,
      "*\\": 621,
      "Morphisms": 622,
      "stri": 623,
      "eno": 624,
      "Spaces": 625,
      "ea": 626,
      "equation": 627,
      "example": 628,
      "red": 629,
      "ess": 630,
      "Sec": 631,
      "min": 632,
      "ization": 633,
      "will": 634,
      "ran": 635,
      "indu": 636,
      "tions": 637,
      "))": 638,
      "ull": 639,
      "To": 640,
      "inte": 641,
      "',": 642,
      "colim": 643,
      "tic": 644,
      "ting": 645,
      "cor": 646,
      "mersion": 647,
      "property": 648,
      "immersion": 649,
      "La": 650,
      "ral": 651,
      "i_": 652,
      "non": 653,
      "Ga": 654,
      "more": 655,
      "vers": 656,
      "Lambda": 657,
      "represent": 658,
      "conclu": 659,
      "Gamma": 660,
      "Section": 661,
      "ced": 662,
      "sy": 663,
      "integ": 664,
      "finition": 665,
      "under": 666,
      "Definition": 667,
      "pri": 668,
      "reg": 669,
      "div": 670,
      "$(\\": 671,
      "ause": 672,
      "ft": 673,
      "}$,": 674,
      "theore": 675,
      "prove": 676,
      "impl": 677,
      "conclude": 678,
      "regular": 679,
      "Con": 680,
      "hence": 681,
      "Ome": 682,
      "Omega": 683,
      "ish": 684,
      "sider": 685,
      "ication": 686,
      "ste": 687,
      "formal": 688,
      "perf": 689,
      "deg": 690,
      "respon": 691,
      "dire": 692,
      "correspon": 693,
      "beta": 694,
      "ffic": 695,
      "Re": 696,
      "extension": 697,
      "ard": 698,
      "]$": 699,
      "ppf": 700,
      "relative": 701,
      "fppf": 702,
      "hold": 703,
      "free": 704,
      "_k": 705,
      "each": 706,
      "ang": 707,
      "left": 708,
      "ense": 709,
      "properties": 710,
      "bec": 711,
      "because": 712,
      "univers": 713,
      "only": 714,
      "delta": 715,
      "X_i": 716,
      "Hom_": 717,
      "cho": 718,
      "get": 719,
      "other": 720,
      ")$,": 721,
      "back": 722,
      "cle": 723,
      "composition": 724,
      "lambda": 725,
      "U_": 726,
      "ints": 727,
      "x_1": 728,
      "pull": 729,
      "isor": 730,
      "^{\\": 731,
      "enote": 732,
      "cup": 733,
      "ormal": 734,
      "find": 735,
      "otimes_R": 736,
      "perfect": 737,
      "_Y": 738,
      "It": 739,
      "mi": 740,
      "fir": 741,
      "group": 742,
      "first": 743,
      "form": 744,
      "ces": 745,
      "Sch": 746,
      "derived": 747,
      "same": 748,
      "product": 749,
      "ure": 750,
      "ort": 751,
      "suffic": 752,
      "})$.": 753,
      "points": 754,
      "tin": 755,
      "}|": 756,
      "tau": 757,
      "pose": 758,
      "implies": 759,
      "leq": 760,
      "categories": 761,
      "restri": 762,
      "diff": 763,
      "nolimits": 764,
      "equivalent": 765,
      "sul": 766,
      "char": 767,
      "resul": 768,
      "ding": 769,
      "pr": 770,
      "ay": 771,
      "Cho": 772,
      "rings": 773,
      "quad": 774,
      "ous": 775,
      "upo": 776,
      "condi": 777,
      "suffices": 778,
      "}/": 779,
      "fa": 780,
      "sig": 781,
      "proposition": 782,
      "sites": 783,
      "charact": 784,
      "Ob": 785,
      "obtain": 786,
      "}[": 787,
      "prime": 788,
      "mapsto": 789,
      "one": 790,
      "disc": 791,
      "sit": 792,
      "holds": 793,
      "pullback": 794,
      "equivalence": 795,
      "representable": 796,
      "ential": 797,
      "$\\{": 798,
      "ith": 799,
      "normal": 800,
      "nolimits_": 801,
      "wo": 802,
      "integral": 803,
      ")}": 804,
      "}$-": 805,
      "projective": 806,
      "wor": 807,
      "prod": 808,
      "commuta": 809,
      "belian": 810,
      "reduci": 811,
      "igh": 812,
      "onical": 813,
      "gamma": 814,
      "abelian": 815,
      "canonical": 816,
      "ful": 817,
      "situation": 818,
      "reducible": 819,
      "\\}": 820,
      "A_": 821,
      "irreducible": 822,
      "eck": 823,
      "graded": 824,
      "ker": 825,
      "topology": 826,
      "divisor": 827,
      "a_": 828,
      "sump": 829,
      "into": 830,
      "ise": 831,
      "'$.": 832,
      "dual": 833,
      "also": 834,
      "contain": 835,
      "whose": 836,
      "}^{": 837,
      "vi": 838,
      "\\{": 839,
      "fac": 840,
      "differ": 841,
      "S_": 842,
      "jo": 843,
      "Choose": 844,
      "D_": 845,
      "*}": 846,
      "topolog": 847,
      "ser": 848,
      "ame": 849,
      "cally": 850,
      "finitely": 851,
      "m_": 852,
      "otimes_A": 853,
      "groupo": 854,
      "omega": 855,
      "geom": 856,
      "direct": 857,
      "assump": 858,
      "construction": 859,
      "defined": 860,
      "ak": 861,
      "lying": 862,
      "commutative": 863,
      "tran": 864,
      "tors": 865,
      "val": 866,
      "g_": 867,
      "tori": 868,
      "inverse": 869,
      "bigoplus": 870,
      "Consider": 871,
      "theorem": 872,
      "geomet": 873,
      "sat": 874,
      "f_i": 875,
      "Cohomology": 876,
      "general": 877,
      "joint": 878,
      "uniqu": 879,
      "descent": 880,
      "Sup": 881,
      "stem": 882,
      "soci": 883,
      "system": 884,
      "x_": 885,
      "ringed": 886,
      "ugh": 887,
      "differential": 888,
      "eta": 889,
      "sigma": 890,
      "f_1": 891,
      "associ": 892,
      "objects": 893,
      "complexes": 894,
      "]^": 895,
      "fied": 896,
      "commute": 897,
      "generated": 898,
      "Note": 899,
      "jection": 900,
      "ij": 901,
      "complete": 902,
      "our": 903,
      "mpl": 904,
      "say": 905,
      "geometri": 906,
      "amely": 907,
      "j_": 908,
      "two": 909,
      "tra": 910,
      "pu": 911,
      "ick": 912,
      "check": 913,
      "Lemmas": 914,
      "fact": 915,
      "sol": 916,
      "sets": 917,
      "sing": 918,
      "\\}$": 919,
      "M_": 920,
      "_S": 921,
      "QCoh": 922,
      "hom": 923,
      "Categor": 924,
      "ten": 925,
      "Categories": 926,
      "ids": 927,
      "restriction": 928,
      "Set": 929,
      "ant": 930,
      "reduced": 931,
      "clas": 932,
      "stacks": 933,
      "triang": 934,
      "universally": 935,
      "eriz": 936,
      "rite": 937,
      "ue": 938,
      "boun": 939,
      "_x": 940,
      "pa": 941,
      "spec": 942,
      "exist": 943,
      "corresponding": 944,
      "characteriz": 945,
      "ness": 946,
      "clear": 947,
      "degree": 948,
      "satis": 949,
      "these": 950,
      "omorph": 951,
      "result": 952,
      "times_S": 953,
      "Omega_": 954,
      "quo": 955,
      "underline": 956,
      "state": 957,
      "omit": 958,
      "functors": 959,
      "spect": 960,
      "since": 961,
      "nu": 962,
      "nel": 963,
      "invertible": 964,
      "kernel": 965,
      "Se": 966,
      "Delta": 967,
      "omorphic": 968,
      "forma": 969,
      "R_": 970,
      "Mod": 971,
      "ary": 972,
      "onent": 973,
      "inter": 974,
      "emp": 975,
      "component": 976,
      "plac": 977,
      "associated": 978,
      "empty": 979,
      "times_Y": 980,
      "x_n": 981,
      "discus": 982,
      "Sche": 983,
      "man": 984,
      "construc": 985,
      "neigh": 986,
      "Schemes": 987,
      "x_i": 988,
      "partic": 989,
      "particular": 990,
      "udo": 991,
      "seudo": 992,
      "ke": 993,
      "bour": 994,
      "cong": 995,
      "Remark": 996,
      "pseudo": 997,
      "supp": 998,
      "smal": 999,
      "Namely": 1000,
      "li": 1001,
      "icial": 1002,
      "statement": 1003,
      "unique": 1004,
      "psilon": 1005,
      "assumption": 1006,
      "neighbour": 1007,
      "neighbourho": 1008,
      "_p": 1009,
      "epsilon": 1010,
      "'/": 1011,
      "cise": 1012,
      "special": 1013,
      "rami": 1014,
      "ramified": 1015,
      "homo": 1016,
      "colimit": 1017,
      "nonzero": 1018,
      "'}$": 1019,
      "topological": 1020,
      "solu": 1021,
      "subscheme": 1022,
      "denote": 1023,
      "dep": 1024,
      "mon": 1025,
      "commutes": 1026,
      "nec": 1027,
      "define": 1028,
      "cture": 1029,
      "_A": 1030,
      "Y_": 1031,
      "mean": 1032,
      "simpl": 1033,
      "out": 1034,
      "trans": 1035,
      "tient": 1036,
      "minus": 1037,
      "replac": 1038,
      "Proposition": 1039,
      "condition": 1040,
      "')$": 1041,
      "izing": 1042,
      "$|": 1043,
      "Mor": 1044,
      "limit": 1045,
      "Suppose": 1046,
      "structure": 1047,
      "quotient": 1048,
      "unramified": 1049,
      "Zar": 1050,
      "Proper": 1051,
      "til": 1052,
      "choose": 1053,
      "``": 1054,
      "setminus": 1055,
      "identi": 1056,
      "bounded": 1057,
      "isomorphic": 1058,
      "}),": 1059,
      "times_X": 1060,
      "cts": 1061,
      "tilde": 1062,
      "There": 1063,
      "ites": 1064,
      "contin": 1065,
      "Sites": 1066,
      "characterize": 1067,
      "go": 1068,
      "top": 1069,
      "hand": 1070,
      "Moreover": 1071,
      "wer": 1072,
      "Rf_": 1073,
      "L_": 1074,
      "small": 1075,
      "_Z": 1076,
      "serve": 1077,
      "ired": 1078,
      "formation": 1079,
      "simplicial": 1080,
      "adjoint": 1081,
      "tru": 1082,
      "T_i": 1083,
      "pair": 1084,
      "fibres": 1085,
      "groupoids": 1086,
      "tom": 1087,
      "/(": 1088,
      "blow": 1089,
      "true": 1090,
      "i_0": 1091,
      "completion": 1092,
      "bigcup": 1093,
      "fication": 1094,
      "ithful": 1095,
      "Properties": 1096,
      "fil": 1097,
      "faithful": 1098,
      "king": 1099,
      "tation": 1100,
      "neighbourhood": 1101,
      "equality": 1102,
      "}'$": 1103,
      "elements": 1104,
      "ig": 1105,
      "_V": 1106,
      "bet": 1107,
      "Z_": 1108,
      "descend": 1109,
      "sections": 1110,
      "cur": 1111,
      "means": 1112,
      "geometrically": 1113,
      "Ker": 1114,
      "functori": 1115,
      "part": 1116,
      "desired": 1117,
      "continu": 1118,
      "cite": 1119,
      "|$": 1120,
      "sor": 1121,
      "arly": 1122,
      "localization": 1123,
      "stal": 1124,
      "generic": 1125,
      ".,": 1126,
      "using": 1127,
      "eaf": 1128,
      "Sheaf": 1129,
      "lif": 1130,
      "short": 1131,
      "mul": 1132,
      "push": 1133,
      "weak": 1134,
      "ented": 1135,
      "presented": 1136,
      ".\\": 1137,
      "power": 1138,
      "fp": 1139,
      "An": 1140,
      "connec": 1141,
      "triangle": 1142,
      "maxi": 1143,
      "maximal": 1144,
      "continuous": 1145,
      "rough": 1146,
      "ideals": 1147,
      "secon": 1148,
      "second": 1149,
      "medi": 1150,
      "van": 1151,
      "functorial": 1152,
      "mediate": 1153,
      "tensor": 1154,
      "Denote": 1155,
      "support": 1156,
      "separable": 1157,
      "$[": 1158,
      "Derived": 1159,
      "main": 1160,
      "compa": 1161,
      "cent": 1162,
      "after": 1163,
      "dec": 1164,
      "Ext": 1165,
      "car": 1166,
      "formally": 1167,
      "connected": 1168,
      "through": 1169,
      "sure": 1170,
      "B_": 1171,
      "ni": 1172,
      "fies": 1173,
      "Sit": 1174,
      "Situation": 1175,
      "products": 1176,
      "stand": 1177,
      "forw": 1178,
      "vial": 1179,
      "laim": 1180,
      "algebras": 1181,
      "ercise": 1182,
      "ight": 1183,
      "ensel": 1184,
      "ag": 1185,
      "iant": 1186,
      "words": 1187,
      "ument": 1188,
      "dot": 1189,
      "solution": 1190,
      "sup": 1191,
      "ie": 1192,
      "tional": 1193,
      "eng": 1194,
      "ges": 1195,
      "trivial": 1196,
      "stalk": 1197,
      "hensel": 1198,
      "when": 1199,
      "Here": 1200,
      "_r": 1201,
      "}/\\": 1202,
      "dualizing": 1203,
      "induces": 1204,
      "icken": 1205,
      "vanish": 1206,
      "topoi": 1207,
      "fy": 1208,
      "ween": 1209,
      "ength": 1210,
      "consider": 1211,
      "between": 1212,
      "strict": 1213,
      "thicken": 1214,
      "Ex": 1215,
      "length": 1216,
      "mber": 1217,
      "Observe": 1218,
      "exercise": 1219,
      "V_": 1220,
      "eff": 1221,
      "term": 1222,
      "call": 1223,
      "multi": 1224,
      "inf": 1225,
      "sian": 1226,
      "ong": 1227,
      "tesian": 1228,
      "forward": 1229,
      "isomorphisms": 1230,
      "gives": 1231,
      "mini": 1232,
      "ective": 1233,
      "claim": 1234,
      "homomorphism": 1235,
      "ign": 1236,
      "cartesian": 1237,
      "]$.": 1238,
      "omial": 1239,
      "))$": 1240,
      "onal": 1241,
      "way": 1242,
      "induction": 1243,
      "{(": 1244,
      "poly": 1245,
      "standard": 1246,
      "minimal": 1247,
      "teri": 1248,
      "gonal": 1249,
      "qc": 1250,
      "compu": 1251,
      "align": 1252,
      "tail": 1253,
      "]^{": 1254,
      "See": 1255,
      "write": 1256,
      "ple": 1257,
      "factors": 1258,
      "thickening": 1259,
      "ative": 1260,
      ")(": 1261,
      "tal": 1262,
      "universal": 1263,
      "closure": 1264,
      "cy": 1265,
      "well": 1266,
      "hy": 1267,
      "immediate": 1268,
      "polyn": 1269,
      "contained": 1270,
      "[\\": 1271,
      "K_": 1272,
      "h_": 1273,
      "polynomial": 1274,
      "does": 1275,
      "xrightarrow": 1276,
      "Fin": 1277,
      "now": 1278,
      "groups": 1279,
      "St": 1280,
      "diagonal": 1281,
      "wide": 1282,
      "homotop": 1283,
      "star": 1284,
      "induced": 1285,
      "omitted": 1286,
      "effective": 1287,
      "tered": 1288,
      "ished": 1289,
      "order": 1290,
      "infty": 1291,
      "K_n": 1292,
      "but": 1293,
      "Com": 1294,
      "tiv": 1295,
      "arg": 1296,
      "both": 1297,
      "formul": 1298,
      "orem": 1299,
      "rr": 1300,
      "cted": 1301,
      "shows": 1302,
      "torsion": 1303,
      "fo": 1304,
      "mapp": 1305,
      "constructible": 1306,
      "ize": 1307,
      "apply": 1308,
      "const": 1309,
      "descri": 1310,
      "intersection": 1311,
      "Giv": 1312,
      "components": 1313,
      "ieties": 1314,
      "erence": 1315,
      "notation": 1316,
      "Given": 1317,
      "Mor_": 1318,
      "Theorem": 1319,
      "disting": 1320,
      "coprod": 1321,
      "lit": 1322,
      "conditions": 1323,
      "distingu": 1324,
      "compatible": 1325,
      "ses": 1326,
      "iski": 1327,
      "multipl": 1328,
      "_f": 1329,
      "Stack": 1330,
      "cycle": 1331,
      "satisfies": 1332,
      "divisors": 1333,
      "rational": 1334,
      "Stacks": 1335,
      "ab": 1336,
      "function": 1337,
      "_T": 1338,
      "fields": 1339,
      "lob": 1340,
      "graph": 1341,
      "discussion": 1342,
      "rie": 1343,
      "Y_i": 1344,
      "_m": 1345,
      "glob": 1346,
      "ving": 1347,
      "constant": 1348,
      "class": 1349,
      "distinguished": 1350,
      "proves": 1351,
      "tomic": 1352,
      "ntomic": 1353,
      "fibred": 1354,
      "Finally": 1355,
      "syntomic": 1356,
      "spectral": 1357,
      "1_": 1358,
      "work": 1359,
      "presheaf": 1360,
      "{-": 1361,
      "gl": 1362,
      "X_0": 1363,
      "pushforward": 1364,
      ")^": 1365,
      "dense": 1366,
      "V_i": 1367,
      "filtered": 1368,
      "mapping": 1369,
      "F_": 1370,
      "S_i": 1371,
      "number": 1372,
      "opens": 1373,
      "integer": 1374,
      "resi": 1375,
      "'$,": 1376,
      ")]": 1377,
      "tivity": 1378,
      "tent": 1379,
      "alo": 1380,
      "ilarly": 1381,
      "vanishing": 1382,
      "sible": 1383,
      "(-": 1384,
      "addi": 1385,
      "_3": 1386,
      "squa": 1387,
      "tails": 1388,
      "valuation": 1389,
      "cri": 1390,
      "}}$": 1391,
      "}^{\\": 1392,
      "finish": 1393,
      "square": 1394,
      "coverings": 1395,
      "n_": 1396,
      "note": 1397,
      "domain": 1398,
      "ences": 1399,
      "resolution": 1400,
      "compare": 1401,
      "due": 1402,
      "depth": 1403,
      "mily": 1404,
      "family": 1405,
      "nih": 1406,
      "NL_": 1407,
      "fpqc": 1408,
      "glue": 1409,
      "annih": 1410,
      "Zariski": 1411,
      "what": 1412,
      "W_": 1413,
      "ther": 1414,
      "directed": 1415,
      "Ar": 1416,
      "Proof": 1417,
      "tial": 1418,
      "Recall": 1419,
      "shrie": 1420,
      "shriek": 1421,
      "])": 1422,
      "On": 1423,
      "surjection": 1424,
      "weakly": 1425,
      "Example": 1426,
      "ata": 1427,
      "X_1": 1428,
      "formula": 1429,
      "sense": 1430,
      "urce": 1431,
      "source": 1432,
      "V_j": 1433,
      "ven": 1434,
      "replace": 1435,
      "global": 1436,
      "union": 1437,
      "lift": 1438,
      "varphi_": 1439,
      "ot": 1440,
      "au": 1441,
      "X_s": 1442,
      "split": 1443,
      "contra": 1444,
      "inclu": 1445,
      "arp": 1446,
      "preser": 1447,
      "adic": 1448,
      "ast": 1449,
      "ell": 1450,
      "sharp": 1451,
      "monomorphism": 1452,
      "sis": 1453,
      "izer": 1454,
      "A_i": 1455,
      "Im": 1456,
      "theoretic": 1457,
      "defines": 1458,
      "linear": 1459,
      "exactly": 1460,
      "cdot": 1461,
      "para": 1462,
      "homotopy": 1463,
      "amal": 1464,
      "primes": 1465,
      "existence": 1466,
      "U_j": 1467,
      "residue": 1468,
      "tier": 1469,
      "corresponds": 1470,
      "T_": 1471,
      "valu": 1472,
      "*(": 1473,
      "pla": 1474,
      "subcategory": 1475,
      "Car": 1476,
      "comes": 1477,
      "led": 1478,
      "uld": 1479,
      "variant": 1480,
      "ates": 1481,
      "})$,": 1482,
      "longmapsto": 1483,
      "Write": 1484,
      "Z_i": 1485,
      "c_1": 1486,
      "Right": 1487,
      "bed": 1488,
      "side": 1489,
      "groupoid": 1490,
      "criteri": 1491,
      "ive": 1492,
      "tar": 1493,
      "sim": 1494,
      "A_1": 1495,
      "Pic": 1496,
      "hat": 1497,
      "arrows": 1498,
      "inclusion": 1499,
      "target": 1500,
      "rees": 1501,
      "many": 1502,
      "argument": 1503,
      "Cartier": 1504,
      "nonempty": 1505,
      "bit": 1506,
      "Rightarrow": 1507,
      "odule": 1508,
      "eness": 1509,
      "rodu": 1510,
      "}^{-": 1511,
      "um": 1512,
      "Tot": 1513,
      "Ab": 1514,
      "verse": 1515,
      "]/(": 1516,
      "rea": 1517,
      "und": 1518,
      "*}\\": 1519,
      "know": 1520,
      "H_": 1521,
      "Par": 1522,
      "reference": 1523,
      "subspace": 1524,
      "via": 1525,
      "g_i": 1526,
      "colimits": 1527,
      "blowup": 1528,
      "mid": 1529,
      "theta": 1530,
      "appl": 1531,
      "compute": 1532,
      "Des": 1533,
      "inci": 1534,
      "'(": 1535,
      "ou": 1536,
      "ice": 1537,
      "choice": 1538,
      "p_": 1539,
      "vious": 1540,
      "mis": 1541,
      "depend": 1542,
      "I_": 1543,
      "a_i": 1544,
      "f_r": 1545,
      "projection": 1546,
      "most": 1547,
      "_R": 1548,
      "rank": 1549,
      "M_i": 1550,
      "details": 1551,
      "potent": 1552,
      "dim_": 1553,
      "X_n": 1554,
      "pi_": 1555,
      "frac": 1556,
      "tau_": 1557,
      "coun": 1558,
      "Topo": 1559,
      "amalg": 1560,
      "Descent": 1561,
      "[(": 1562,
      "princi": 1563,
      "*$": 1564,
      "widetilde": 1565,
      "xiom": 1566,
      "specialization": 1567,
      "col": 1568,
      "partial": 1569,
      "pure": 1570,
      "genera": 1571,
      "results": 1572,
      "fully": 1573,
      "constructed": 1574,
      "below": 1575,
      "Af": 1576,
      "construct": 1577,
      "paragraph": 1578,
      "classes": 1579,
      "rete": 1580,
      "^!": 1581,
      "presheaves": 1582,
      "bar": 1583,
      "inde": 1584,
      "lea": 1585,
      "ju": 1586,
      "vee": 1587,
      "otimes_k": 1588,
      "vie": 1589,
      "rule": 1590,
      "geometric": 1591,
      "SheafHom": 1592,
      "hyper": 1593,
      "vec": 1594,
      "curves": 1595,
      "satisfy": 1596,
      "annihil": 1597,
      "termin": 1598,
      "suppose": 1599,
      "s_": 1600,
      "tical": 1601,
      "enough": 1602,
      "final": 1603,
      "s_i": 1604,
      "read": 1605,
      "send": 1606,
      "@{": 1607,
      "discrete": 1608,
      "differentials": 1609,
      "Homology": 1610,
      "criterion": 1611,
      "colim_": 1612,
      "normalization": 1613,
      "odules": 1614,
      "introdu": 1615,
      "extensions": 1616,
      "]{": 1617,
      "^*(": 1618,
      "ern": 1619,
      "Artin": 1620,
      "pos": 1621,
      "thing": 1622,
      "tives": 1623,
      "}')": 1624,
      "angent": 1625,
      "reader": 1626,
      "relation": 1627,
      "terms": 1628,
      "factori": 1629,
      "here": 1630,
      "'})": 1631,
      "total": 1632,
      "omega_": 1633,
      "emptyset": 1634,
      "henselian": 1635,
      "tangent": 1636,
      "zation": 1637,
      "character": 1638,
      "SheafHom_": 1639,
      "fraction": 1640,
      "factorization": 1641,
      ")$-": 1642,
      "Sets": 1643,
      "em": 1644,
      "along": 1645,
      "ized": 1646,
      "ient": 1647,
      "images": 1648,
      "ided": 1649,
      "Sim": 1650,
      "b_": 1651,
      "mit": 1652,
      "After": 1653,
      ")\\": 1654,
      "a_1": 1655,
      "notion": 1656,
      "Div": 1657,
      "Ass": 1658,
      "]^{\\": 1659,
      "called": 1660,
      "x_0": 1661,
      "verif": 1662,
      "ulated": 1663,
      "immediately": 1664,
      "times_U": 1665,
      "replacing": 1666,
      "i_1": 1667,
      "localize": 1668,
      "just": 1669,
      "ink": 1670,
      "triangulated": 1671,
      "bas": 1672,
      "basis": 1673,
      "reduce": 1674,
      "reas": 1675,
      "inal": 1676,
      "Gro": 1677,
      "lar": 1678,
      "Tor": 1679,
      "urn": 1680,
      "Modules": 1681,
      "nat": 1682,
      "y_1": 1683,
      "decent": 1684,
      "imits": 1685,
      "varieties": 1686,
      "mitted": 1687,
      "extend": 1688,
      "Omitted": 1689,
      "^*$": 1690,
      "Part": 1691,
      "homology": 1692,
      "nd": 1693,
      "@<": 1694,
      "ically": 1695,
      "''$": 1696,
      "dimensional": 1697,
      "igher": 1698,
      "}{": 1699,
      "rd": 1700,
      "rum": 1701,
      "spectrum": 1702,
      "colle": 1703,
      "take": 1704,
      "turn": 1705,
      ">[": 1706,
      "bigoplus_": 1707,
      "apter": 1708,
      "ither": 1709,
      "}}(": 1710,
      "Limits": 1711,
      "Using": 1712,
      "_s": 1713,
      "seen": 1714,
      "disjoint": 1715,
      "K_0": 1716,
      "ory": 1717,
      "tr": 1718,
      "descending": 1719,
      "kes": 1720,
      "vector": 1721,
      "$}": 1722,
      ")^\\": 1723,
      "injec": 1724,
      ")}$": 1725,
      "B_i": 1726,
      "vertical": 1727,
      "rig": 1728,
      "definitions": 1729,
      "cat": 1730,
      "istic": 1731,
      "identity": 1732,
      "bin": 1733,
      "equalizer": 1734,
      "wn": 1735,
      "make": 1736,
      "[-": 1737,
      "higher": 1738,
      "os": 1739,
      "bigcup_": 1740,
      "n_i": 1741,
      "summa": 1742,
      "Proj": 1743,
      "contains": 1744,
      "cha": 1745,
      "sequences": 1746,
      "Sch_": 1747,
      "characteristic": 1748,
      "topologies": 1749,
      "12": 1750,
      "consis": 1751,
      "leads": 1752,
      "mathit": 1753,
      "ord": 1754,
      "flatness": 1755,
      "_B": 1756,
      "ss": 1757,
      "}]": 1758,
      "stalks": 1759,
      "good": 1760,
      "ass": 1761,
      "}))": 1762,
      "f_j": 1763,
      "det": 1764,
      "either": 1765,
      "chapter": 1766,
      "clic": 1767,
      "being": 1768,
      ")^{": 1769,
      "Supp": 1770,
      "isors": 1771,
      "Divisors": 1772,
      "manence": 1773,
      "}}(\\": 1774,
      "M_n": 1775,
      "c_": 1776,
      "used": 1777,
      "sums": 1778,
      "zul": 1779,
      "henselization": 1780,
      "oszul": 1781,
      "U_0": 1782,
      "permanence": 1783,
      "stein": 1784,
      ")}(": 1785,
      "omin": 1786,
      "A_0": 1787,
      "\\}$.": 1788,
      "acy": 1789,
      "g_1": 1790,
      "action": 1791,
      "missible": 1792,
      "!\\": 1793,
      "independ": 1794,
      "],": 1795,
      "axiom": 1796,
      "cour": 1797,
      "makes": 1798,
      "entially": 1799,
      "course": 1800,
      "_a": 1801,
      "Cohen": 1802,
      "i_p": 1803,
      "decom": 1804,
      "App": 1805,
      "_t": 1806,
      "_d": 1807,
      "y_i": 1808,
      "')$.": 1809,
      "Ho": 1810,
      "d_": 1811,
      "ger": 1812,
      "strictly": 1813,
      "Similarly": 1814,
      "_g": 1815,
      "wever": 1816,
      "lis": 1817,
      "sk": 1818,
      "versely": 1819,
      "collection": 1820,
      "Fir": 1821,
      "proetale": 1822,
      "essentially": 1823,
      "First": 1824,
      "multiplic": 1825,
      "admissible": 1826,
      "determin": 1827,
      "containing": 1828,
      "vari": 1829,
      "str": 1830,
      "bil": 1831,
      "think": 1832,
      "pal": 1833,
      "sheafi": 1834,
      "acyclic": 1835,
      "$).": 1836,
      "')^{-": 1837,
      "faithfully": 1838,
      "annihilated": 1839,
      "tically": 1840,
      "table": 1841,
      "immersions": 1842,
      "cof": 1843,
      "f_n": 1844,
      "m_i": 1845,
      "taking": 1846,
      "respect": 1847,
      "Conversely": 1848,
      "alois": 1849,
      "chain": 1850,
      "However": 1851,
      "')^*": 1852,
      "assumptions": 1853,
      "give": 1854,
      "U_1": 1855,
      "principal": 1856,
      "leadsto": 1857,
      "Next": 1858,
      "urther": 1859,
      "agree": 1860,
      "ual": 1861,
      "((\\": 1862,
      "Mac": 1863,
      "Pick": 1864,
      "additive": 1865,
      "genus": 1866,
      ">}[": 1867,
      "finishes": 1868,
      "A_n": 1869,
      "glueing": 1870,
      "multiplication": 1871,
      "index": 1872,
      "S_0": 1873,
      "simple": 1874,
      "domin": 1875,
      "how": 1876,
      "underlying": 1877,
      "Et": 1878,
      "aul": 1879,
      "}}^\\": 1880,
      "unit": 1881,
      "degrees": 1882,
      "Macaul": 1883,
      "Macaulay": 1884,
      "nil": 1885,
      "omega_X": 1886,
      "blowing": 1887,
      "arbit": 1888,
      "curve": 1889,
      "supset": 1890,
      "embed": 1891,
      "arbitr": 1892,
      "((": 1893,
      "generate": 1894,
      "going": 1895,
      "obs": 1896,
      "correspond": 1897,
      "foot": 1898,
      "footnote": 1899,
      "full": 1900,
      "Coker": 1901,
      "Lf": 1902,
      "Say": 1903,
      "chi": 1904,
      "unc": 1905,
      "independent": 1906,
      "ber": 1907,
      "projec": 1908,
      "proved": 1909,
      "loc": 1910,
      "stra": 1911,
      "auto": 1912,
      "ude": 1913,
      "ready": 1914,
      "stable": 1915,
      "sheafification": 1916,
      "play": 1917,
      "Cur": 1918,
      "]^\\": 1919,
      "win": 1920,
      "subsets": 1921,
      "arbitrary": 1922,
      "})}(": 1923,
      "Hom_R": 1924,
      "Curves": 1925,
      "'}(": 1926,
      ".)": 1927,
      "home": 1928,
      "enstein": 1929,
      "Var": 1930,
      "W_i": 1931,
      "Now": 1932,
      "X_2": 1933,
      "hor": 1934,
      "U_n": 1935,
      "p_i": 1936,
      "you": 1937,
      "ler": 1938,
      "P_": 1939,
      "already": 1940,
      "restrict": 1941,
      "))$.": 1942,
      "need": 1943,
      "Delta_": 1944,
      "vation": 1945,
      "proj": 1946,
      "algebraically": 1947,
      "^+": 1948,
      "lang": 1949,
      "q_": 1950,
      "gain": 1951,
      "slog": 1952,
      "cokernel": 1953,
      "slogan": 1954,
      "infinite": 1955,
      "triple": 1956,
      "suppor": 1957,
      "descrip": 1958,
      "nilpotent": 1959,
      "ampl": 1960,
      "^\\#": 1961,
      "precise": 1962,
      "divided": 1963,
      "--": 1964,
      "With": 1965,
      "bullet_": 1966,
      "versal": 1967,
      "m_A": 1968,
      "otimes_B": 1969,
      "center": 1970,
      "acobs": 1971,
      "acobson": 1972,
      "!}\\": 1973,
      "representing": 1974,
      "'',": 1975,
      "alog": 1976,
      "strong": 1977,
      "logical": 1978,
      "homeomorphism": 1979,
      "1ex": 1980,
      "Y_0": 1981,
      "summand": 1982,
      "itude": 1983,
      "horiz": 1984,
      ")[": 1985,
      "enary": 1986,
      "analog": 1987,
      "atum": 1988,
      "setting": 1989,
      "works": 1990,
      "amplitude": 1991,
      "cument": 1992,
      ",\\": 1993,
      "|$.": 1994,
      "ention": 1995,
      "systems": 1996,
      "exce": 1997,
      "invariant": 1998,
      "\\{\\": 1999,
      "played": 2000,
      "data": 2001,
      "|\\": 2002,
      "mod": 2003,
      "Algebraic": 2004,
      "would": 2005,
      "description": 2006,
      "horizon": 2007,
      "noetherian": 2008,
      "duality": 2009,
      "transform": 2010,
      "catenary": 2011,
      "Varieties": 2012,
      "last": 2013,
      "horizontal": 2014,
      "down": 2015,
      "x_2": 2016,
      "{/": 2017,
      "appro": 2018,
      "cases": 2019,
      "bly": 2020,
      "injectives": 2021,
      "hypercovering": 2022,
      "wise": 2023,
      "alter": 2024,
      "eous": 2025,
      "natur": 2026,
      "Z_1": 2027,
      "sign": 2028,
      "'}$.": 2029,
      "homogen": 2030,
      "subschemes": 2031,
      "displayed": 2032,
      "CM": 2033,
      "fines": 2034,
      "elementary": 2035,
      "different": 2036,
      "datum": 2037,
      "similarly": 2038,
      "decomposition": 2039,
      "ually": 2040,
      "verification": 2041,
      "chow": 2042,
      "x_r": 2043,
      "_W": 2044,
      "further": 2045,
      "lci": 2046,
      "alpha_": 2047,
      "Deformation": 2048,
      "discussed": 2049,
      "theory": 2050,
      "about": 2051,
      "functoriality": 2052,
      "dic": 2053,
      "represented": 2054,
      "trace": 2055,
      "homogeneous": 2056,
      "constructions": 2057,
      "ys": 2058,
      "II": 2059,
      "rho": 2060,
      "appli": 2061,
      "generators": 2062,
      "applied": 2063,
      "without": 2064,
      "indic": 2065,
      "uniqueness": 2066,
      "R_i": 2067,
      "effic": 2068,
      "agata": 2069,
      "implication": 2070,
      "omega_A": 2071,
      "efficient": 2072,
      "usu": 2073,
      "modu": 2074,
      "transition": 2075,
      "ways": 2076,
      "natural": 2077,
      "CH": 2078,
      "pairs": 2079,
      "submodule": 2080,
      "sends": 2081,
      "NL": 2082,
      "endo": 2083,
      "coefficient": 2084,
      "pusho": 2085,
      "ities": 2086,
      "applies": 2087,
      "sep": 2088,
      "e_1": 2089,
      "mention": 2090,
      "y_": 2091,
      "singular": 2092,
      "hypo": 2093,
      "nonzerodivisor": 2094,
      "supported": 2095,
      "Koszul": 2096,
      "deformation": 2097,
      "epsilon_": 2098,
      "Of": 2099,
      "e_": 2100,
      "large": 2101,
      "A_2": 2102,
      "M_1": 2103,
      "fix": 2104,
      "ird": 2105,
      "Formal": 2106,
      "widehat": 2107,
      "W_j": 2108,
      "opp": 2109,
      "possible": 2110,
      "again": 2111,
      "times_B": 2112,
      "bility": 2113,
      "struction": 2114,
      "consisting": 2115,
      "p_1": 2116,
      "}})": 2117,
      "contradic": 2118,
      "Topology": 2119,
      "put": 2120,
      "ariant": 2121,
      "dotted": 2122,
      "deri": 2123,
      "too": 2124,
      "imp": 2125,
      "diagrams": 2126,
      "filtra": 2127,
      "C_i": 2128,
      "Dual": 2129,
      "cech": 2130,
      "h_U": 2131,
      "endi": 2132,
      "cocontinuous": 2133,
      "X_y": 2134,
      "rang": 2135,
      "cycles": 2136,
      "document": 2137,
      "2w": 2138,
      "But": 2139,
      "fit": 2140,
      "xima": 2141,
      "functions": 2142,
      "satisfying": 2143,
      "thickenings": 2144,
      "reason": 2145,
      "{+": 2146,
      "Fi": 2147,
      "setup": 2148,
      "[[": 2149,
      "'|": 2150,
      "nM": 2151,
      "next": 2152,
      "{\\{": 2153,
      "Ch": 2154,
      "third": 2155,
      "bran": 2156,
      "theoretically": 2157,
      "prod_": 2158,
      "vcenter": 2159,
      "asser": 2160,
      "obvious": 2161,
      "branch": 2162,
      "Y_1": 2163,
      "ques": 2164,
      "f_2": 2165,
      "Jacobson": 2166,
      "bund": 2167,
      "compose": 2168,
      "bundle": 2169,
      "ech": 2170,
      "q_i": 2171,
      "transformation": 2172,
      "@{=": 2173,
      "Groupo": 2174,
      "bijective": 2175,
      "rangle": 2176,
      "Galois": 2177,
      "loo": 2178,
      "refore": 2179,
      "tification": 2180,
      "reduces": 2181,
      "langle": 2182,
      "E_": 2183,
      "gr": 2184,
      "pt": 2185,
      "simp": 2186,
      "simply": 2187,
      "F_i": 2188,
      "combin": 2189,
      "logies": 2190,
      "approxima": 2191,
      "Groupoids": 2192,
      "cotangent": 2193,
      "previous": 2194,
      "varphi_i": 2195,
      ")/\\": 2196,
      "identification": 2197,
      "Hom_A": 2198,
      "bound": 2199,
      "Shea": 2200,
      "CH_": 2201,
      "Some": 2202,
      "always": 2203,
      "ating": 2204,
      "codimension": 2205,
      "conven": 2206,
      "^{(": 2207,
      "mental": 2208,
      "Qu": 2209,
      "')^\\": 2210,
      "surjec": 2211,
      "pi_1": 2212,
      "application": 2213,
      "nal": 2214,
      "shr": 2215,
      "value": 2216,
      "ry": 2217,
      "version": 2218,
      "damental": 2219,
      "analogue": 2220,
      "max": 2221,
      "These": 2222,
      "alpha_i": 2223,
      "factor": 2224,
      "'})$": 2225,
      "phan": 2226,
      "mann": 2227,
      "Ad": 2228,
      "ysin": 2229,
      "phantom": 2230,
      "fore": 2231,
      "dou": 2232,
      "thendi": 2233,
      "viewed": 2234,
      "'$-": 2235,
      "Bec": 2236,
      "e_i": 2237,
      "valuative": 2238,
      "thendieck": 2239,
      "Because": 2240,
      "torsor": 2241,
      "internal": 2242,
      "filtration": 2243,
      "cone": 2244,
      "Any": 2245,
      "plain": 2246,
      "usual": 2247,
      "Lo": 2248,
      "inking": 2249,
      "Sheaves": 2250,
      "namely": 2251,
      "triangles": 2252,
      "Curvesstack": 2253,
      "$)": 2254,
      "B_1": 2255,
      "ods": 2256,
      "equi": 2257,
      "bijection": 2258,
      "times_T": 2259,
      "reduction": 2260,
      ")/": 2261,
      "even": 2262,
      "gu": 2263,
      "they": 2264,
      "ety": 2265,
      "lim_": 2266,
      ")|": 2267,
      "sitive": 2268,
      "affines": 2269,
      "preserving": 2270,
      "variety": 2271,
      "gysin": 2272,
      "double": 2273,
      "-\\'": 2274,
      "requ": 2275,
      "Chow": 2276,
      "$|\\": 2277,
      "purely": 2278,
      "*(\\": 2279,
      "chern": 2280,
      "Applying": 2281,
      "multiplicative": 2282,
      "than": 2283,
      "a_0": 2284,
      "gamma_": 2285,
      "b_i": 2286,
      "cd": 2287,
      "deno": 2288,
      "topos": 2289,
      "step": 2290,
      "discuss": 2291,
      "]$,": 2292,
      "often": 2293,
      "ba": 2294,
      "ftri": 2295,
      "pic": 2296,
      "ghtarrow": 2297,
      "R_f": 2298,
      "ftrightarrow": 2299,
      "_y": 2300,
      "dedu": 2301,
      "blem": 2302,
      "applying": 2303,
      "Topologies": 2304,
      "formations": 2305,
      "RS": 2306,
      "Follow": 2307,
      "derivation": 2308,
      "Hil": 2309,
      "cend": 2310,
      "asy": 2311,
      "explain": 2312,
      "fundamental": 2313,
      "X_T": 2314,
      "sigma_": 2315,
      "}''": 2316,
      "@{=}[": 2317,
      "RF": 2318,
      "ev": 2319,
      "ray": 2320,
      "embedding": 2321,
      "pushout": 2322,
      "IB": 2323,
      "T_0": 2324,
      "oper": 2325,
      "@{-": 2326,
      "turns": 2327,
      "endowed": 2328,
      "Follows": 2329,
      "lower": 2330,
      "}^\\#": 2331,
      "axioms": 2332,
      "otstra": 2333,
      "ivariant": 2334,
      "exactness": 2335,
      "gerbe": 2336,
      "dg": 2337,
      "pick": 2338,
      "rest": 2339,
      "f_c": 2340,
      "')^": 2341,
      "H_1": 2342,
      "am": 2343,
      "consequence": 2344,
      "relatively": 2345,
      "clearly": 2346,
      "splitting": 2347,
      "Picard": 2348,
      "countable": 2349,
      "otstrap": 2350,
      "el": 2351,
      "ether": 2352,
      "examples": 2353,
      "Gamma_": 2354,
      "Etale": 2355,
      "!$": 2356,
      "ep": 2357,
      "easy": 2358,
      "inseparable": 2359,
      "denoted": 2360,
      "bivariant": 2361,
      "easi": 2362,
      "Cle": 2363,
      "K_i": 2364,
      "a_n": 2365,
      "dal": 2366,
      "i_j": 2367,
      "}'}": 2368,
      "lls": 2369,
      "Gor": 2370,
      "^{+": 2371,
      "]^-": 2372,
      "Gorenstein": 2373,
      "Lg": 2374,
      "a_2": 2375,
      "complement": 2376,
      "terial": 2377,
      "generator": 2378,
      "another": 2379,
      "Comple": 2380,
      "K_1": 2381,
      "ade": 2382,
      "R_0": 2383,
      "quate": 2384,
      "assertion": 2385,
      "till": 2386,
      "coherence": 2387,
      "observe": 2388,
      "described": 2389,
      "hi": 2390,
      "precisely": 2391,
      "question": 2392,
      "problem": 2393,
      "those": 2394,
      "describe": 2395,
      "'')": 2396,
      "card": 2397,
      "want": 2398,
      "ilar": 2399,
      "view": 2400,
      "]/": 2401,
